Revit 2027 API
IFCFileModelOptions.SchemaName Property
 The name of the schema.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SchemaName { get; set; }
Public Property SchemaName As String
	Get
	Set
public:
property String^ SchemaName {
	String^ get ();
	void set (String^ value);
}
member SchemaName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace